import random


characters_name = [
    "雷电将军",
    "九条裟罗",
    "宵宫",
    "早柚",
    "神里绫华",
    "枫原万叶",
    "优菈",
    "烟绯",
    "罗莎莉亚",
    "胡桃",
    "魈",
    "甘雨",
    "阿贝多",
    "钟离",
    "辛焱",
    "达达利亚",
    "迪奥娜",
    "可莉",
    "温迪",
    "刻晴",
    "莫娜",
    "七七",
    "迪卢克",
    "琴",
    "砂糖",
    "重云",
    "诺艾尔",
    "班尼特",
    "菲谢尔",
    "凝光",
    "行秋",
    "北斗",
    "香菱",
    "雷泽",
    "芭芭拉",
    "丽莎",
    "凯亚",
    "安柏",
]


def random_equip():
    return random.choice(characters_name) + "已装备"
